Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSpu_regdef.h
/**
 * \file IfxSpu_regdef.h
 * \brief
 * \copyright Copyright (c) 2015 Infineon Technologies AG. All rights reserved.
 *
 *
 * Date: 2015-12-17 16:14:55 GMT
 * Version: TBD
 * Specification: TBD
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Spu_Registers SpuRegisters
 * \ingroup IfxLld
 * 
 * \defgroup IfxLld_Spu_Registers_Bitfields Bitfields
 * \ingroup IfxLld_Spu_Registers
 * 
 * \defgroup IfxLld_Spu_Registers_union Register unions
 * \ingroup IfxLld_Spu_Registers
 * 
 * \defgroup IfxLld_Spu_Registers_struct Memory map
 * \ingroup IfxLld_Spu_Registers
 */
#ifndef IFXSPU_REGDEF_H
#define IFXSPU_REGDEF_H 1
/******************************************************************************/
#include "Ifx_TypesReg.h"
/******************************************************************************/
/** \addtogroup IfxLld_Spu_Bitfields
 * \{  */
/** \brief Access Enable Register 0 */
typedef struct _Ifx_SPU_ACCEN0_Bits
{
    Ifx_UReg_32Bit EN0_EN:1;          /**< \brief [0:0] Access Enable for Master TAG ID n (rw) */
    Ifx_UReg_32Bit EN1_EN:1;          /**< \brief [1:1] Access Enable for Master TAG ID n (rw) */
    Ifx_UReg_32Bit EN2_EN:1;          /**< \brief [2:2] Access Enable for Master TAG ID n (rw) */
    Ifx_UReg_32Bit EN3_EN:1;          /**< \brief [3:3] Access Enable for Master TAG ID n (rw) */
    Ifx_UReg_32Bit EN4_EN:1;          /**< \brief [4:4] Access Enable for Master TAG ID n (rw) */
    Ifx_UReg_32Bit EN5_EN:1;          /**< \brief [5:5] Access Enable for Master TAG ID n (rw) */
    Ifx_UReg_32Bit EN6_EN:1;          /**< \brief [6:6] Access Enable for Master TAG ID n (rw) */
    Ifx_UReg_32Bit EN7_EN:1;          /**< \brief [7:7] Access Enable for Master TAG ID n (rw) */
    Ifx_UReg_32Bit EN8_EN:1;          /**< \brief [8:8] Access Enable for Master TAG ID n (rw) */
    Ifx_UReg_32Bit EN9_EN:1;          /**< \brief [9:9] Access Enable for Master TAG ID n (rw) */
    Ifx_UReg_32Bit EN10_EN:1;         /**< \brief [10:10] Access Enable for Master TAG ID n (rw) */
    Ifx_UReg_32Bit EN11_EN:1;         /**< \brief [11:11] Access Enable for Master TAG ID n (rw) */
    Ifx_UReg_32Bit EN12_EN:1;         /**< \brief [12:12] Access Enable for Master TAG ID n (rw) */
    Ifx_UReg_32Bit EN13_EN:1;         /**< \brief [13:13] Access Enable for Master TAG ID n (rw) */
    Ifx_UReg_32Bit EN14_EN:1;         /**< \brief [14:14] Access Enable for Master TAG ID n (rw) */
    Ifx_UReg_32Bit EN15_EN:1;         /**< \brief [15:15] Access Enable for Master TAG ID n (rw) */
    Ifx_UReg_32Bit EN16_EN:1;         /**< \brief [16:16] Access Enable for Master TAG ID n (rw) */
    Ifx_UReg_32Bit EN17_EN:1;         /**< \brief [17:17] Access Enable for Master TAG ID n (rw) */
    Ifx_UReg_32Bit EN18_EN:1;         /**< \brief [18:18] Access Enable for Master TAG ID n (rw) */
    Ifx_UReg_32Bit EN19_EN:1;         /**< \brief [19:19] Access Enable for Master TAG ID n (rw) */
    Ifx_UReg_32Bit EN20_EN:1;         /**< \brief [20:20] Access Enable for Master TAG ID n (rw) */
    Ifx_UReg_32Bit EN21_EN:1;         /**< \brief [21:21] Access Enable for Master TAG ID n (rw) */
    Ifx_UReg_32Bit EN22_EN:1;         /**< \brief [22:22] Access Enable for Master TAG ID n (rw) */
    Ifx_UReg_32Bit EN23_EN:1;         /**< \brief [23:23] Access Enable for Master TAG ID n (rw) */
    Ifx_UReg_32Bit EN24_EN:1;         /**< \brief [24:24] Access Enable for Master TAG ID n (rw) */
    Ifx_UReg_32Bit EN25_EN:1;         /**< \brief [25:25] Access Enable for Master TAG ID n (rw) */
    Ifx_UReg_32Bit EN26_EN:1;         /**< \brief [26:26] Access Enable for Master TAG ID n (rw) */
    Ifx_UReg_32Bit EN27_EN:1;         /**< \brief [27:27] Access Enable for Master TAG ID n (rw) */
    Ifx_UReg_32Bit EN28_EN:1;         /**< \brief [28:28] Access Enable for Master TAG ID n (rw) */
    Ifx_UReg_32Bit EN29_EN:1;         /**< \brief [29:29] Access Enable for Master TAG ID n (rw) */
    Ifx_UReg_32Bit EN30_EN:1;         /**< \brief [30:30] Access Enable for Master TAG ID n (rw) */
    Ifx_UReg_32Bit EN31_EN:1;         /**< \brief [31:31] Access Enable for Master TAG ID n (rw) */
} Ifx_SPU_ACCEN0_Bits;

/** \brief Access Enable Register 1 */
typedef struct _Ifx_SPU_ACCEN1_Bits
{
    Ifx_UReg_32Bit RES:32;            /**< \brief [31:0] Reserved (r) */
} Ifx_SPU_ACCEN1_Bits;

/** \brief Antenna Offset */
typedef struct _Ifx_SPU_BE_A_ANTOFST_Bits
{
    Ifx_UReg_32Bit ADROFST0_ANT0:16;    /**< \brief [15:0] Antenna Offset Address (rw) */
    Ifx_UReg_32Bit ADROFST1_ANT1:16;    /**< \brief [31:16] Antenna Offset Address (rw) */
} Ifx_SPU_BE_A_ANTOFST_Bits;

/** \brief CFAR Module Control */
typedef struct _Ifx_SPU_BE_CFARCTRL_Bits
{
    Ifx_UReg_32Bit BASE:19;           /**< \brief [18:0] CFAR Base Address (rw) */
    Ifx_UReg_32Bit SEWIN:6;           /**< \brief [24:19] Spectrum Extension Window (rw) */
    Ifx_UReg_32Bit EXTNSN:2;          /**< \brief [26:25] Spectrum Extension (rw) */
    Ifx_UReg_32Bit CFAR_CAE:1;        /**< \brief [27:27] CFAR CA Engine Enable (rw) */
    Ifx_UReg_32Bit CFAR_GOSE:1;       /**< \brief [28:28] CFAR GOS Engine Enable (rw) */
    Ifx_UReg_32Bit CFAREN:3;          /**< \brief [31:29] CFAR Module Enable (rw) */
} Ifx_SPU_BE_CFARCTRL_Bits;

/** \brief Loader Configuration */
typedef struct _Ifx_SPU_BE_LDR_CONF_Bits
{
    Ifx_UReg_32Bit DRPL:8;            /**< \brief [7:0] Drop Last (rwh) */
    Ifx_UReg_32Bit DRPF:8;            /**< \brief [15:8] Drop First (rwh) */
    Ifx_UReg_32Bit EXPNT:6;           /**< \brief [21:16] Common Exponent (rwh) */
    Ifx_UReg_32Bit PHSHFT:2;          /**< \brief [23:22] Fast Phase Shift (rw) */
    Ifx_UReg_32Bit SIZE:4;            /**< \brief [27:24] FFT Size (rw) */
    Ifx_UReg_32Bit FORMAT:2;          /**< \brief [29:28] Window Data Format (rw) */
    Ifx_UReg_32Bit FFTBYPS:1;         /**< \brief [30:30] FFT Bypass (rw) */
    Ifx_UReg_32Bit IFFT:1;            /**< \brief [31:31] Inverse FFT Enable (rw) */
} Ifx_SPU_BE_LDR_CONF_Bits;

/** \brief Loader Configuration Extended */
typedef struct _Ifx_SPU_BE_LDR_CONF2_Bits
{
    Ifx_UReg_32Bit WBASE:16;          /**< \brief [15:0] Window Coefficient Base Address (rw) */
    Ifx_UReg_32Bit PADF:13;           /**< \brief [28:16] Pad at Front (rwh) */
    Ifx_UReg_32Bit RES:2;             /**< \brief [30:29] Reserved (r) */
    Ifx_UReg_32Bit WINEN:1;           /**< \brief [31:31] Window Function Enable (rw) */
} Ifx_SPU_BE_LDR_CONF2_Bits;

/** \brief NCI Control */
typedef struct _Ifx_SPU_BE_NCICTRL_Bits
{
    Ifx_UReg_32Bit BASE:19;           /**< \brief [18:0] Radar Memory Base Address (rw) */
    Ifx_UReg_32Bit EN:1;              /**< \brief [19:19] Enable (rw) */
    Ifx_UReg_32Bit FORMAT:2;          /**< \brief [21:20] Output Format (rwh) */
    Ifx_UReg_32Bit SCALE:2;           /**< \brief [23:22] Result Scaling (rw) */
    Ifx_UReg_32Bit RES:8;             /**< \brief [31:24] Reserved (r) */
} Ifx_SPU_BE_NCICTRL_Bits;

/** \brief Output Data Processor Configuration */
typedef struct _Ifx_SPU_BE_ODP_CONF_Bits
{
    Ifx_UReg_32Bit BASE:19;           /**< \brief [18:0] Radar Memory Base Address (rw) */
    Ifx_UReg_32Bit MODE:1;            /**< \brief [19:19] ODP Mode (rw) */
    Ifx_UReg_32Bit FTR:1;             /**< \brief [20:20] Force to Real (rw) */
    Ifx_UReg_32Bit SCALE:1;           /**< \brief [21:21] Scale Results to 16 bit (rw) */
    Ifx_UReg_32Bit EXPNT:5;           /**< \brief [26:22] Common Exponent (rw) */
    Ifx_UReg_32Bit IPF:1;             /**< \brief [27:27] In Place FFT (rw) */
    Ifx_UReg_32Bit RES:4;             /**< \brief [31:28] Reserved (r) */
} Ifx_SPU_BE_ODP_CONF_Bits;

/** \brief Power Information Channel Control */
typedef struct _Ifx_SPU_BE_PWRCTRL_Bits
{
    Ifx_UReg_32Bit BASE:19;           /**< \brief [18:0] Radar Memory Base Address (rw) */
    Ifx_UReg_32Bit RES:12;            /**< \brief [30:19] Reserved (r) */
    Ifx_UReg_32Bit EN:1;              /**< \brief [31:31] Enable (rw) */
} Ifx_SPU_BE_PWRCTRL_Bits;

/** \brief Power Summation */
typedef struct _Ifx_SPU_BE_PWRSUM_Bits
{
    Ifx_UReg_32Bit BASE:19;           /**< \brief [18:0] Radar Memory Base Address (rw) */
    Ifx_UReg_32Bit SCALE:2;           /**< \brief [20:19] Sum Antenna Result Scaling (rw) */
    Ifx_UReg_32Bit FORMAT:2;          /**< \brief [22:21] Output Format (rwh) */
    Ifx_UReg_32Bit RES:9;             /**< \brief [31:23] Reserved (r) */
} Ifx_SPU_BE_PWRSUM_Bits;

/** \brief Sideband Control */
typedef struct _Ifx_SPU_BE_SBCTRL_Bits
{
    Ifx_UReg_32Bit BASE:19;           /**< \brief [18:0] Radar Memory Base Address (rw) */
    Ifx_UReg_32Bit RES:12;            /**< \brief [30:19] Reserved (r) */
    Ifx_UReg_32Bit EN:1;              /**< \brief [31:31] Enable (rw) */
} Ifx_SPU_BE_SBCTRL_Bits;

