Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSpu_regdef.h
/** \brief Summation Unit Control */
typedef struct _Ifx_SPU_BE_SUMCTRL_Bits
{
    Ifx_UReg_32Bit BASE:19;           /**< \brief [18:0] Radar Memory Base Address (rw) */
    Ifx_UReg_32Bit PWRMODE:1;         /**< \brief [19:19] Power Mode (rw) */
    Ifx_UReg_32Bit SUMMODE:2;         /**< \brief [21:20] Summation Mode (rw) */
    Ifx_UReg_32Bit REAL:1;            /**< \brief [22:22] Real Component Only (rw) */
    Ifx_UReg_32Bit USEANT:8;          /**< \brief [30:23] Antennae to Use (rw) */
    Ifx_UReg_32Bit RES:1;             /**< \brief [31:31] Reserved (rw) */
} Ifx_SPU_BE_SUMCTRL_Bits;

/** \brief Unloader Configuration */
typedef struct _Ifx_SPU_BE_UNLDR_CONF_Bits
{
    Ifx_UReg_32Bit EXPNT:5;           /**< \brief [4:0] Common Exponent (rw) */
    Ifx_UReg_32Bit FORMAT:1;          /**< \brief [5:5] Input Data Format (rw) */
    Ifx_UReg_32Bit HISTEN:1;          /**< \brief [6:6] Histogram Enable (rwh) */
    Ifx_UReg_32Bit HAFE:1;            /**< \brief [7:7] Histogram Antenna Filter Enable (rw) */
    Ifx_UReg_32Bit AFV:3;             /**< \brief [10:8] Antenna Filter Value (rw) */
    Ifx_UReg_32Bit RES:2;             /**< \brief [12:11] Reserved (r) */
    Ifx_UReg_32Bit HISTBINS:3;        /**< \brief [15:13] Number of power values per histogram bin. (rw) */
    Ifx_UReg_32Bit HISTBASE:16;       /**< \brief [31:16] Histogram Base Address (rw) */
} Ifx_SPU_BE_UNLDR_CONF_Bits;

/** \brief Unloader Configuration 2 */
typedef struct _Ifx_SPU_BE_UNLDR_CONF2_Bits
{
    Ifx_UReg_32Bit STRT:16;           /**< \brief [15:0] Start Count (rw) */
    Ifx_UReg_32Bit END:16;            /**< \brief [31:16] End Count (rw) */
} Ifx_SPU_BE_UNLDR_CONF2_Bits;

/** \brief Bin Rejection Unit Control */
typedef struct _Ifx_SPU_BINREJCTRL_Bits
{
    Ifx_UReg_32Bit RMODE:2;           /**< \brief [1:0] Bin Rejection Mode (rw) */
    Ifx_UReg_32Bit ZMODE:1;           /**< \brief [2:2] Threshold Rejection Mode (rw) */
    Ifx_UReg_32Bit LJUST:1;           /**< \brief [3:3] Left Justify (rw) */
    Ifx_UReg_32Bit VALUE:24;          /**< \brief [27:4] Threshold Value (rw) */
    Ifx_UReg_32Bit RES:4;             /**< \brief [31:28] Reserved (r) */
} Ifx_SPU_BINREJCTRL_Bits;

/** \brief Bin Rejection Mask */
typedef struct _Ifx_SPU_BIN_REJ_Bits
{
    Ifx_UReg_32Bit B0_R0:1;           /**< \brief [0:0] BIN (rw) */
    Ifx_UReg_32Bit B1_R1:1;           /**< \brief [1:1] BIN (rw) */
    Ifx_UReg_32Bit B2_R2:1;           /**< \brief [2:2] BIN (rw) */
    Ifx_UReg_32Bit B3_R3:1;           /**< \brief [3:3] BIN (rw) */
    Ifx_UReg_32Bit B4_R4:1;           /**< \brief [4:4] BIN (rw) */
    Ifx_UReg_32Bit B5_R5:1;           /**< \brief [5:5] BIN (rw) */
    Ifx_UReg_32Bit B6_R6:1;           /**< \brief [6:6] BIN (rw) */
    Ifx_UReg_32Bit B7_R7:1;           /**< \brief [7:7] BIN (rw) */
    Ifx_UReg_32Bit B8_R8:1;           /**< \brief [8:8] BIN (rw) */
    Ifx_UReg_32Bit B9_R9:1;           /**< \brief [9:9] BIN (rw) */
    Ifx_UReg_32Bit B10_R10:1;         /**< \brief [10:10] BIN (rw) */
    Ifx_UReg_32Bit B11_R11:1;         /**< \brief [11:11] BIN (rw) */
    Ifx_UReg_32Bit B12_R12:1;         /**< \brief [12:12] BIN (rw) */
    Ifx_UReg_32Bit B13_R13:1;         /**< \brief [13:13] BIN (rw) */
    Ifx_UReg_32Bit B14_R14:1;         /**< \brief [14:14] BIN (rw) */
    Ifx_UReg_32Bit B15_R15:1;         /**< \brief [15:15] BIN (rw) */
    Ifx_UReg_32Bit B16_R16:1;         /**< \brief [16:16] BIN (rw) */
    Ifx_UReg_32Bit B17_R17:1;         /**< \brief [17:17] BIN (rw) */
    Ifx_UReg_32Bit B18_R18:1;         /**< \brief [18:18] BIN (rw) */
    Ifx_UReg_32Bit B19_R19:1;         /**< \brief [19:19] BIN (rw) */
    Ifx_UReg_32Bit B20_R20:1;         /**< \brief [20:20] BIN (rw) */
    Ifx_UReg_32Bit B21_R21:1;         /**< \brief [21:21] BIN (rw) */
    Ifx_UReg_32Bit B22_R22:1;         /**< \brief [22:22] BIN (rw) */
    Ifx_UReg_32Bit B23_R23:1;         /**< \brief [23:23] BIN (rw) */
    Ifx_UReg_32Bit B24_R24:1;         /**< \brief [24:24] BIN (rw) */
    Ifx_UReg_32Bit B25_R25:1;         /**< \brief [25:25] BIN (rw) */
    Ifx_UReg_32Bit B26_R26:1;         /**< \brief [26:26] BIN (rw) */
    Ifx_UReg_32Bit B27_R27:1;         /**< \brief [27:27] BIN (rw) */
    Ifx_UReg_32Bit B28_R28:1;         /**< \brief [28:28] BIN (rw) */
    Ifx_UReg_32Bit B29_R29:1;         /**< \brief [29:29] BIN (rw) */
    Ifx_UReg_32Bit B30_R30:1;         /**< \brief [30:30] BIN (rw) */
    Ifx_UReg_32Bit B31_R31:1;         /**< \brief [31:31] BIN (rw) */
} Ifx_SPU_BIN_REJ_Bits;

/** \brief Bin Rejection Unit Load Count */
typedef struct _Ifx_SPU_BRCNT_Bits
{
    Ifx_UReg_32Bit CNT:20;            /**< \brief [19:0] Access Count (rh) */
    Ifx_UReg_32Bit RES:12;            /**< \brief [31:20] Reserved (r) */
} Ifx_SPU_BRCNT_Bits;

/** \brief CFAR Configuration */
typedef struct _Ifx_SPU_CFARCFG_Bits
{
    Ifx_UReg_32Bit CAALGO:2;          /**< \brief [1:0] CA-CFAR Algorithm Select (rw) */
    Ifx_UReg_32Bit GOSALGO:2;         /**< \brief [3:2] GOS-CFAR Algorithm Select (rw) */
    Ifx_UReg_32Bit CAGUARD:6;         /**< \brief [9:4] Guard Cells (rw) */
    Ifx_UReg_32Bit CAWINCELL:3;       /**< \brief [12:10] Window Cells Exponent (rw) */
    Ifx_UReg_32Bit RES:1;             /**< \brief [13:13] Reserved (r) */
    Ifx_UReg_32Bit CFARSEL:2;         /**< \brief [15:14] Inline CFAR Engine (rw) */
    Ifx_UReg_32Bit CABETA:16;         /**< \brief [31:16] CA-CFAR Beta (rw) */
} Ifx_SPU_CFARCFG_Bits;

/** \brief CFAR Configuration 2 */
typedef struct _Ifx_SPU_CFARCFG2_Bits
{
    Ifx_UReg_32Bit GOSGUARD:6;        /**< \brief [5:0] Guard Cells (rw) */
    Ifx_UReg_32Bit IDXLD:5;           /**< \brief [10:6] Index Lead (rw) */
    Ifx_UReg_32Bit IDXLG:5;           /**< \brief [15:11] Index Lag (rw) */
    Ifx_UReg_32Bit GOSWINCELL:6;      /**< \brief [21:16] Window Cells Exponent (rw) */
    Ifx_UReg_32Bit CASHWIN:3;         /**< \brief [24:22] CASH Subwindow (rw) */
    Ifx_UReg_32Bit RES:7;             /**< \brief [31:25] Reserved (r) */
} Ifx_SPU_CFARCFG2_Bits;

/** \brief CFAR Configuration 3 */
typedef struct _Ifx_SPU_CFARCFG3_Bits
{
    Ifx_UReg_32Bit GOSBETA:16;        /**< \brief [15:0] GOS-CFAR Beta (rw) */
    Ifx_UReg_32Bit CHAN5OFFST:16;     /**< \brief [31:16] Channel 5 Address Offset (rw) */
} Ifx_SPU_CFARCFG3_Bits;

